RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Src/stm32h7rsxx_hal_flash_ex.c
  /* Reset error code */
  pFlash.ErrorCode = HAL_FLASH_ERROR_NONE;

  /* Wait for last operation to be completed */
  status = FLASH_WaitForLastOperation(FLASH_TIMEOUT_VALUE);

  if (status == HAL_OK)
  {
    /* Set the bit for the OTP programmation */
    SET_BIT(FLASH->CR, FLASH_CR_PG_OTP);

    /* Set PG_OPT Bit */
    SET_BIT(FLASH->OPTCR, FLASH_OPTCR_PG_OPT);

    /* Configure the write protected area */
    MODIFY_REG(FLASH->OTPLSRP, FLASH_OTPLSRP_OTPL, (OTPLBlock & FLASH_OTPLSRP_OTPL));

    /* Wait for last operation to be completed */
    status = FLASH_WaitForLastOperation(FLASH_TIMEOUT_VALUE);

    /* Clear PG_OPT Bit */
    CLEAR_BIT(FLASH->OPTCR, FLASH_OPTCR_PG_OPT);

    /* Clear the bit for the OTP programmation */
    CLEAR_BIT(FLASH->CR, FLASH_CR_PG_OTP);
  }

  /* Process Unlocked */
  __HAL_UNLOCK(&pFlash);

  return status;
}

/**
  * @brief  Return the FLASH OTP Lock Option Bytes value.
  *
  * @retval Status of the OTP Lock
  */
uint32_t HAL_FLASHEx_GetOTPLock(void)
{
  return (FLASH->OTPLSR & FLASH_OTPLSR_OTPL);
}

/**
  * @brief  Configure the Keys.
  *
  * @note   To configure the Keys options, the option lock bit OPTLOCK must be
  *         cleared with the call of the HAL_FLASH_OB_Unlock() function.
  *
  * @param  pKeyConfig Key(s) to be configured.
  *
  * @param  pKey Address of the key
  *
  * @retval HAL Status
  */
HAL_StatusTypeDef HAL_FLASHEx_KeyConfig(const FLASH_KeyConfigTypeDef *pKeyConfig, const uint32_t *pKey)
{
  uint32_t index;
  uint32_t index_max;
  const uint32_t *pdata;
  HAL_StatusTypeDef status;

  /* Check the parameters */
  assert_param(IS_KEY_INDEX(pKeyConfig->Index));
  assert_param(IS_KEY_SIZE(pKeyConfig->Size));
  assert_param(IS_KEY_HDPL_LEVEL(pKeyConfig->HDPLLevel));

  /* Process Locked */
  __HAL_LOCK(&pFlash);

  /* Reset error code */
  pFlash.ErrorCode = HAL_FLASH_ERROR_NONE;

  /* Wait for last operation to be completed */
  status = FLASH_WaitForLastOperation(FLASH_TIMEOUT_VALUE);

  if (status == HAL_OK)
  {
    /* Set PG_OPT Bit */
    SET_BIT(FLASH->OPTCR, FLASH_OPTCR_PG_OPT);

    switch (pKeyConfig->Size)
    {
      case FLASH_KEY_32_BITS :
        index_max = 1U;
        break;

      case FLASH_KEY_64_BITS :
        index_max = 2U;
        break;

      case FLASH_KEY_128_BITS :
        index_max = 4U;
        break;

      case FLASH_KEY_256_BITS :
        index_max = 8U;
        break;

      default:
        /* This case should not occur */
        index_max = 0U;
        break;
    }

    pdata = pKey;
    for (index = 0U; index < index_max; index++)
    {
      FLASH->OBKDR[index] = pdata[index];
    }

    MODIFY_REG(FLASH->OBKCR, (FLASH_OBKCR_OBKINDEX | FLASH_OBKCR_NEXTKL | FLASH_OBKCR_OBKSIZE),
               (pKeyConfig->Index | pKeyConfig->HDPLLevel | pKeyConfig->Size));

    SET_BIT(FLASH->OBKCR, (FLASH_OBKCR_KEYSTART | FLASH_OBKCR_KEYPROG));

    /* Wait for last operation to be completed */
    status = FLASH_WaitForLastOperation(FLASH_TIMEOUT_VALUE);

    CLEAR_BIT(FLASH->OBKCR, FLASH_OBKCR_KEYPROG);

    /* Clear PG_OPT Bit */
    CLEAR_BIT(FLASH->OPTCR, FLASH_OPTCR_PG_OPT);
  }

  /* Process Unlocked */
  __HAL_UNLOCK(&pFlash);

  return status;
}

/**
  * @brief  Load and optionally return the FLASH Option Bytes Key value.
  *
  * @param pKeyConfig Configuration of the key to be loaded and optionally returned
  *
  * @param pKey Address to return the FLASH Option Bytes Key value if not NULL.
  *
  * @retval HAL Status
  */
HAL_StatusTypeDef HAL_FLASHEx_GetKey(const FLASH_KeyConfigTypeDef *pKeyConfig, uint32_t *pKey)
{
  uint32_t index;
  uint32_t *pdata;
  HAL_StatusTypeDef status;

  /* Check the parameters */
  assert_param(IS_KEY_INDEX(pKeyConfig->Index));
  assert_param(IS_KEY_HDPL_LEVEL(pKeyConfig->HDPLLevel));

  /* Process Locked */
  __HAL_LOCK(&pFlash);

  /* Reset error code */
  pFlash.ErrorCode = HAL_FLASH_ERROR_NONE;

  /* Wait for last operation to be completed */
  status = FLASH_WaitForLastOperation(FLASH_TIMEOUT_VALUE);

  if (status == HAL_OK)
  {
    /* Set PG_OPT Bit */
    SET_BIT(FLASH->OPTCR, FLASH_OPTCR_PG_OPT);

    /* Configure index and HDPL level */
    MODIFY_REG(FLASH->OBKCR, (FLASH_OBKCR_OBKINDEX | FLASH_OBKCR_NEXTKL | FLASH_OBKCR_OBKSIZE | FLASH_OBKCR_KEYPROG),
               (pKeyConfig->Index | pKeyConfig->HDPLLevel));

    /* Set the start bit to get the key value */
    SET_BIT(FLASH->OBKCR, FLASH_OBKCR_KEYSTART);

    /* Wait for last operation to be completed */
    status = FLASH_WaitForLastOperation(FLASH_TIMEOUT_VALUE);

    if ((status == HAL_OK) && (pKey != NULL))
    {
      pdata = pKey;
      for (index = 0U; index < 8U; index++)
      {
        *pdata = FLASH->OBKDR[index];
        pdata++;
      }
    }

    /* Clear PG_OPT Bit */
    CLEAR_BIT(FLASH->OPTCR, FLASH_OPTCR_PG_OPT);
  }

  /* Process Unlocked */
  __HAL_UNLOCK(&pFlash);

  return status;
}

/**
  * @brief  Perform a CRC computation on the specified FLASH memory area
  * @param  pCRCInit pointer to an FLASH_CRCInitTypeDef structure that
  *         contains the configuration information for the CRC computation.
  * @param  CRC_Result pointer to CRC result
  * @note   CRC computation uses CRC-32 (Ethernet) polynomial 0x4C11DB7
  * @retval HAL Status
  */
HAL_StatusTypeDef HAL_FLASHEx_ComputeCRC(const FLASH_CRCInitTypeDef *pCRCInit, uint32_t *CRC_Result)
{
  HAL_StatusTypeDef status;
  uint32_t sector_index;

  /* Check the parameters */
  assert_param(IS_FLASH_TYPE_CRC(pCRCInit->TypeCRC));
  assert_param(IS_FLASH_BURST_SIZE_CRC(pCRCInit->BurstSize));

  /* Wait for last operation to be completed */
  status = FLASH_WaitForLastOperation(FLASH_TIMEOUT_VALUE);

  if (status == HAL_OK)
  {
    /* Process Locked */
    __HAL_LOCK(&pFlash);

    /* Reset error code */
    pFlash.ErrorCode = HAL_FLASH_ERROR_NONE;

    /* Enable CRC feature */
    SET_BIT(FLASH->CR, FLASH_CR_CRC_EN);

    /* Clear CRC flags in Status Register: CRC end of calculation and CRC read error */
    FLASH->ICR = (FLASH_ICR_CRCRDERRF | FLASH_ICR_CRCENDF);

    /* Clear current CRC result and program burst size */
    MODIFY_REG(FLASH->CRCCR, (FLASH_CRCCR_CLEAN_CRC | FLASH_CRCCR_CRC_BURST),
               (FLASH_CRCCR_CLEAN_CRC | pCRCInit->BurstSize));

