RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Src/stm32h7rsxx_hal_flash_ex.c
    if (pCRCInit->TypeCRC == FLASH_CRC_SECTORS)
    {
      /* Select CRC by sector and clear sectors list */
      SET_BIT(FLASH->CRCCR, (FLASH_CRCCR_CRC_BY_SECT | FLASH_CRCCR_CLEAN_SECT));

      /* Select CRC sectors */
      for (sector_index = pCRCInit->Sector; sector_index < (pCRCInit->NbSectors + pCRCInit->Sector); sector_index++)
      {
        FLASH_CRC_AddSector(sector_index);
      }
    }
    else if (pCRCInit->TypeCRC == FLASH_CRC_BANK)
    {
      /* Select CRC by sector and all sectors */
      SET_BIT(FLASH->CRCCR, (FLASH_CRCCR_CRC_BY_SECT | FLASH_CRCCR_ALL_SECT));
    }
    else
    {
      /* Select CRC by address */
      CLEAR_BIT(FLASH->CRCCR, FLASH_CRCCR_CRC_BY_SECT);

      /* Select CRC start and end addresses */
      FLASH_CRC_SelectAddress(pCRCInit->CRCStartAddr, pCRCInit->CRCEndAddr);
    }

    /* Start the CRC calculation */
    SET_BIT(FLASH->CRCCR, FLASH_CRCCR_START_CRC);

    /* Wait on CRC busy flag */
    status = FLASH_CRC_WaitForLastOperation((uint32_t)FLASH_TIMEOUT_VALUE);

    /* Return CRC result */
    (*CRC_Result) = FLASH->CRCDATAR;

    /* Disable CRC feature */
    CLEAR_BIT(FLASH->CR, FLASH_CR_CRC_EN);

    /* Clear CRC flags */
    FLASH->ICR = (FLASH_ICR_CRCRDERRF | FLASH_ICR_CRCENDF);

    /* Process Unlocked */
    __HAL_UNLOCK(&pFlash);
  }

  return status;
}

/**
  * @}
  */

/** @defgroup FLASHEx_Exported_Functions_Group3 Extended ECC operation functions
  *  @brief   Extended ECC operation functions
  *
@verbatim
 ===============================================================================
                  ##### Extended ECC operation functions #####
 ===============================================================================
    [..]
    This subsection provides a set of functions allowing to manage the Extended FLASH
    ECC Operations.

@endverbatim
  * @{
  */
/**
  * @brief  Enable ECC correction interrupt
  * @retval None
  */
void HAL_FLASHEx_EnableEccCorrectionInterrupt(void)
{
  __HAL_FLASH_ENABLE_IT(FLASH_IT_SNECCERR);
}

/**
  * @brief  Disable ECC correction interrupt
  * @retval None
  */
void HAL_FLASHEx_DisableEccCorrectionInterrupt(void)
{
  __HAL_FLASH_DISABLE_IT(FLASH_IT_SNECCERR);
}

/**
  * @brief  Enable ECC detection interrupt
  * @retval None
  */
void HAL_FLASHEx_EnableEccDetectionInterrupt(void)
{
  __HAL_FLASH_ENABLE_IT(FLASH_IT_DBECCERR);
}

/**
  * @brief  Disable ECC detection interrupt
  * @retval None
  */
void HAL_FLASHEx_DisableEccDetectionInterrupt(void)
{
  __HAL_FLASH_DISABLE_IT(FLASH_IT_DBECCERR);
}

/**
  * @brief  Get the ECC error information.
  * @param  pData Pointer to an FLASH_EccInfoTypeDef structure that contains the
  *         ECC error information.
  * @note   This function should be called before ECC bit is cleared
  *         (in callback function)
  * @retval None
  */
void HAL_FLASHEx_GetEccInfo(FLASH_EccInfoTypeDef *pData)
{
  /* Check Null pointer */
  assert_param(pData != NULL);

  /* Set address which generate ECC error */
  if ((FLASH->ISR & FLASH_FLAG_SNECCERR) != 0U)
  {
    pData->Address = FLASH->ECCSFADDR;
  }
  else
  {
    pData->Address = FLASH->ECCDFADDR;
  }

  /* Set area according address */
  if (IS_FLASH_MAIN_MEM_ADDRESS(pData->Address))
  {
    pData->Area = FLASH_ECC_AREA_USER_BANK1;
  }
  else if (IS_FLASH_OTP_ADDRESS(pData->Address))
  {
    pData->Area = FLASH_ECC_AREA_OTP;
  }
  else if ((pData->Address >= SYSTEM_FLASH_BASE) &&
           (pData->Address < (SYSTEM_FLASH_BASE + SYSTEM_FLASH_SIZE)))
  {
    pData->Area = FLASH_ECC_AREA_SYSTEM;
  }
  else
  {
    pData->Area = FLASH_ECC_AREA_READ_ONLY;
  }

  /* Set Master which initiates transaction. On H7RS, it's necessary CPU1 */
  pData->MasterID = FLASH_ECC_MASTER_CPU1;
}

/**
  * @brief  Handle Flash ECC Detection interrupt request.
  * @note   On STM32H7RS, this Irq Handler should be called in Bus Fault
  *         interrupt subroutine.
  * @retval None
  */
void HAL_FLASHEx_ECCD_IRQHandler(void)
{
  /* Check ECC Detection Error */
  if ((FLASH->ISR & FLASH_FLAG_DBECCERR) != 0U)
  {
    /* Call User callback */
    HAL_FLASHEx_EccDetectionCallback();

    /* Clear ECC detection flag in order to allow new ECC error record */
    FLASH->ICR = FLASH_FLAG_DBECCERR;
  }
}

/**
  * @brief  FLASH ECC Correction interrupt callback.
  * @retval None
  */
__weak void HAL_FLASHEx_EccCorrectionCallback(void)
{
  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_FLASHEx_EccCorrectionCallback could be implemented in the user file
   */
}

/**
  * @brief  FLASH ECC Detection interrupt callback.
  * @retval None
  */
__weak void HAL_FLASHEx_EccDetectionCallback(void)
{
  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_FLASHEx_EccDetectionCallback could be implemented in the user file
   */
}

/**
  * @}
  */

/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/

/** @addtogroup FLASHEx_Private_Functions
  * @{
  */
/**
  * @brief  Mass erase of FLASH memory.
  * @retval None
  */
static void FLASH_MassErase(void)
{
  /* Set the Mass Erase Bit and proceed to erase */
  SET_BIT(FLASH->CR, (FLASH_CR_BER | FLASH_CR_START));
}

/**
  * @brief  Erase the specified FLASH memory sector.
  * @param  Sector FLASH sector to erase
  *         This parameter must be a value between 0 and (max number of sectors in the bank - 1)
  * @retval None
  */
void FLASH_SectorErase(uint32_t Sector)
{
  /* Check the parameters */
  assert_param(IS_FLASH_SECTOR(Sector));

  /* Proceed to erase the page */
  MODIFY_REG(FLASH->CR, (FLASH_CR_SSN | FLASH_CR_SER | FLASH_CR_START), \
             ((Sector << FLASH_CR_SSN_Pos) | FLASH_CR_SER | FLASH_CR_START));
}

/**
  * @brief  Configure the write protection of the desired sectors.
  *
  * @note   To configure the WRP options, the option lock bit OPTLOCK must be
  *         cleared with the call of the HAL_FLASH_OB_Unlock() function.
  *
  * @param  WRPState
  *
  * @param  WRPSector
  *
  * @retval None
  */
static void FLASH_OB_WRPConfig(uint32_t WRPState, uint32_t WRPSector)
{
  /* Check the parameters */
  assert_param(IS_OB_WRPSTATE(WRPState));

  /* Configure the write protected area */
  if (WRPState == OB_WRPSTATE_DISABLE)
  {
    FLASH->WRPSRP |= (WRPSector & FLASH_WRPSRP_WRPS);
  }
  else if (WRPState == OB_WRPSTATE_ENABLE)
  {
    FLASH->WRPSRP &= (~(WRPSector & FLASH_WRPSRP_WRPS));
  }
  else
  {
    /* Empty statement (to be compliant MISRA 15.7) */
  }
}

/**
  * @brief  Program the FLASH User Option Byte.
  *
  * @note   To configure the user option bytes, the option lock bit OPTLOCK must
  *         be cleared with the call of the HAL_FLASH_OB_Unlock() function.
  * @param  UserType: The FLASH User Option Bytes to be modified.
  *         This parameter can be a combination of @ref FLASH_OB_USER_TYPE
  * @param  UserConfig1 The selected User Option Bytes values
  * @param  UserConfig2 The selected User Option Bytes values
  * @retval None
  */
static void FLASH_OB_UserConfig(uint32_t UserType, uint32_t UserConfig1, uint32_t UserConfig2)
{
  uint32_t optr_reg_val = 0;
  uint32_t optr_reg_mask = 0;

  /* Check the parameters */
  assert_param(IS_OB_USER_TYPE(UserType));

