RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Src/stm32h7rsxx_hal_flash_ex.c
  if ((UserType & OB_USER_BOR_LEV) != 0U)
  {
    /* BOR level option byte should be modified */
    assert_param(IS_OB_USER_BOR_LEVEL(UserConfig1 & FLASH_OBW1SR_BOR_LEVEL));

    /* Set value and mask for BOR level option byte */
    optr_reg_val |= (UserConfig1 & FLASH_OBW1SR_BOR_LEVEL);
    optr_reg_mask |= FLASH_OBW1SR_BOR_LEVEL;
  }

  if ((UserType & OB_USER_IWDG_SW) != 0U)
  {
    /* IWDG1_HW option byte should be modified */
    assert_param(IS_OB_USER_IWDG(UserConfig1 & FLASH_OBW1SR_IWDG_HW));

    /* Set value and mask for IWDG1_HW option byte */
    optr_reg_val |= (UserConfig1 & FLASH_OBW1SR_IWDG_HW);
    optr_reg_mask |= FLASH_OBW1SR_IWDG_HW;
  }

  if ((UserType & OB_USER_NRST_STOP) != 0U)
  {
    /* NRST_STOP_D1 option byte should be modified */
    assert_param(IS_OB_USER_STOP(UserConfig1 & FLASH_OBW1SR_NRST_STOP));

    /* Set value and mask for NRST_STOP_D1 option byte */
    optr_reg_val |= (UserConfig1 & FLASH_OBW1SR_NRST_STOP);
    optr_reg_mask |= FLASH_OBW1SR_NRST_STOP;
  }

  if ((UserType & OB_USER_NRST_STDBY) != 0U)
  {
    /* NRST_STBY_D1 option byte should be modified */
    assert_param(IS_OB_USER_STANDBY(UserConfig1 & FLASH_OBW1SR_NRST_STBY));

    /* Set value and mask for NRST_STBY_D1 option byte */
    optr_reg_val |= (UserConfig1 & FLASH_OBW1SR_NRST_STBY);
    optr_reg_mask |= FLASH_OBW1SR_NRST_STBY;
  }

  if ((UserType & OB_USER_XSPI1_HSLV) != 0U)
  {
    /* XSPI1_HSLV option byte should be modified */
    assert_param(IS_OB_USER_XSPI1_HSLV(UserConfig1 & FLASH_OBW1SR_XSPI1_HSLV));

    /* Set value and mask for XSPI1_HSLV option byte */
    optr_reg_val |= (UserConfig1 & FLASH_OBW1SR_XSPI1_HSLV);
    optr_reg_mask |= FLASH_OBW1SR_XSPI1_HSLV;
  }

  if ((UserType & OB_USER_XSPI2_HSLV) != 0U)
  {
    /* XSPI2_HSLV option byte should be modified */
    assert_param(IS_OB_USER_XSPI2_HSLV(UserConfig1 & FLASH_OBW1SR_XSPI2_HSLV));

    /* Set value and mask for XSPI2_HSLV option byte */
    optr_reg_val |= (UserConfig1 & FLASH_OBW1SR_XSPI2_HSLV);
    optr_reg_mask |= FLASH_OBW1SR_XSPI2_HSLV;
  }

  if ((UserType & OB_USER_IWDG_STOP) != 0U)
  {
    /* IWDG_FZ_STOP option byte should be modified */
    assert_param(IS_OB_USER_IWDG_STOP(UserConfig1 & FLASH_OBW1SR_IWDG_FZ_STOP));

    /* Set value and mask for IWDG_FZ_STOP option byte */
    optr_reg_val |= (UserConfig1 & FLASH_OBW1SR_IWDG_FZ_STOP);
    optr_reg_mask |= FLASH_OBW1SR_IWDG_FZ_STOP;
  }

  if ((UserType & OB_USER_IWDG_STDBY) != 0U)
  {
    /* IWDG_FZ_SDBY option byte should be modified */
    assert_param(IS_OB_USER_IWDG_STDBY(UserConfig1 & FLASH_OBW1SR_IWDG_FZ_STBY));

    /* Set value and mask for IWDG_FZ_SDBY option byte */
    optr_reg_val |= (UserConfig1 & FLASH_OBW1SR_IWDG_FZ_STBY);
    optr_reg_mask |= FLASH_OBW1SR_IWDG_FZ_STBY;
  }

  if ((UserType & OB_USER_VDDIO_HSLV) != 0U)
  {
    /* VDDIO_HSLV option byte should be modified */
    assert_param(IS_OB_USER_VDDIO_HSLV(UserConfig1 & FLASH_OBW1SR_VDDIO_HSLV));

    /* Set value and mask for VDDIO_HSLV option byte */
    optr_reg_val |= (UserConfig1 & FLASH_OBW1SR_VDDIO_HSLV);
    optr_reg_mask |= FLASH_OBW1SR_VDDIO_HSLV;
  }

  /* Configure the option bytes register 1 if necessary */
  if (optr_reg_mask != 0U)
  {
    MODIFY_REG(FLASH->OBW1SRP, optr_reg_mask, optr_reg_val);
  }

  optr_reg_val = 0;
  optr_reg_mask = 0;

  if ((UserType & OB_USER_ITCM_AXI_SHARE) != 0U)
  {
    /* ITCM_AXI_SHARE option byte should be modified */
    assert_param(IS_OB_USER_ITCM_AXI_SHARE(UserConfig2 & FLASH_OBW2SR_ITCM_AXI_SHARE));

    /* Set value and mask for ITCM_AXI_SHARE option byte */
    optr_reg_val |= (UserConfig2 & FLASH_OBW2SR_ITCM_AXI_SHARE);
    optr_reg_mask |= FLASH_OBW2SR_ITCM_AXI_SHARE;
  }

  if ((UserType & OB_USER_DTCM_AXI_SHARE) != 0U)
  {
    /* DTCM_AXI_SHARE option byte should be modified */
    assert_param(IS_OB_USER_DTCM_AXI_SHARE(UserConfig2 & FLASH_OBW2SR_DTCM_AXI_SHARE));

    /* Set value and mask for DTCM_AXI_SHARE option byte */
    optr_reg_val |= (UserConfig2 & FLASH_OBW2SR_DTCM_AXI_SHARE);
    optr_reg_mask |= FLASH_OBW2SR_DTCM_AXI_SHARE;
  }

  if ((UserType & OB_USER_SRAM_ECC) != 0U)
  {
    /* SRAM_ECC option byte should be modified */
    assert_param(IS_OB_USER_AXISRAM_ECC(UserConfig2 & FLASH_OBW2SR_ECC_ON_SRAM));

    /* Set value and mask for SRAM_ECC option byte */
    optr_reg_val |= (UserConfig2 & FLASH_OBW2SR_ECC_ON_SRAM);
    optr_reg_mask |= FLASH_OBW2SR_ECC_ON_SRAM;
  }

  if ((UserType & OB_USER_I2C_NI3C) != 0U)
  {
    /* I2C_NI3C option byte should be modified */
    assert_param(IS_OB_USER_I2C_NI3C(UserConfig2 & FLASH_OBW2SR_I2C_NI3C));

    /* Set value and mask for I2C_NI3C option byte */
    optr_reg_val |= (UserConfig2 & FLASH_OBW2SR_I2C_NI3C);
    optr_reg_mask |= FLASH_OBW2SR_I2C_NI3C;
  }

  /* Configure the option bytes register 2 if necessary */
  if (optr_reg_mask != 0U)
  {
    MODIFY_REG(FLASH->OBW2SRP, optr_reg_mask, optr_reg_val);
  }
}

/**
  * @brief  Configure the Hide Protection.
  *
  * @note   To configure the HDP options, the option lock bit OPTLOCK must be
  *         cleared with the call of the HAL_FLASH_OB_Unlock() function.
  *
  * @param  HDPStartPage
  *
  * @param  HDPEndPage
  *
  * @retval None
  */
static void FLASH_OB_HDPConfig(uint32_t HDPStartPage, uint32_t HDPEndPage)
{
  /* Check the parameters */
  assert_param(IS_OB_HDP_PAGE(HDPStartPage));
  assert_param(IS_OB_HDP_PAGE(HDPEndPage));

  MODIFY_REG(FLASH->HDPSRP, (FLASH_HDPSRP_HDP_AREA_START | FLASH_HDPSRP_HDP_AREA_END), \
             (HDPStartPage | (HDPEndPage << FLASH_HDPSRP_HDP_AREA_END_Pos)));
}

/**
  * @brief  Configure the Non-Volatile state.
  *
  * @note   To configure the Non-volatile options, the option lock bit OPTLOCK must be
  *         cleared with the call of the HAL_FLASH_OB_Unlock() function.
  *
  * @param  NVState
  *
  * @retval None
  */
static void FLASH_OB_NVConfig(uint32_t NVState)
{
  /* Check the parameter */
  assert_param(IS_OB_NVSTATE(NVState));

  MODIFY_REG(FLASH->NVSRP, FLASH_NVSRP_NVSTATE, NVState);
}

/**
  * @brief  Return the FLASH Write Protection Option Bytes value.
  *
  * @param  WRPState
  *
  * @param  WRPSector
  *
  * @retval None
  */
static void FLASH_OB_GetWRP(uint32_t *WRPState, uint32_t *WRPSector)
{
  if ((FLASH->WRPSR & FLASH_WRPSR_WRPS) == FLASH_WRPSR_WRPS)
  {
    /* All sectors aren't write protected */
    *WRPState = OB_WRPSTATE_DISABLE;
  }
  else
  {
    /* Some sectors are write protected */
    *WRPState = OB_WRPSTATE_ENABLE;
    *WRPSector = ((~(FLASH->WRPSR)) & FLASH_WRPSR_WRPS);
  }
}

/**
  * @brief  Return the FLASH User Option Byte value.
  *
  * @param UserConfig1 Address to return the FLASH User Option Bytes values configuration 1.
  *         The return value can be a combination of
  * @param UserConfig2 Address to return the FLASH User Option Bytes values configuration 2.
  *         The return value can be a combination of
  *
  * @retval None
  */
static void FLASH_OB_GetUser(uint32_t *UserConfig1, uint32_t *UserConfig2)
{
  *UserConfig1 = FLASH->OBW1SR;
  *UserConfig2 = FLASH->OBW2SR;
}

/**
  * @brief  Return the FLASH Hide Protection Option Bytes value.
  *
  * @param HDPStartPage Address to return the FLASH HDP Option Bytes Start Sector.
  *         The return value can be a combination of
  * @param HDPEndPage Address to return the FLASH HDP Option Bytes End Sector.
  *         The return value can be a combination of
  *
  * @retval None
  */
static void FLASH_OB_GetHDP(uint32_t *HDPStartPage, uint32_t *HDPEndPage)
{
  *HDPStartPage = (FLASH->HDPSR & FLASH_HDPSR_HDP_AREA_START);
  *HDPEndPage = ((FLASH->HDPSR & FLASH_HDPSR_HDP_AREA_END) >> FLASH_HDPSR_HDP_AREA_END_Pos);
}

/**
  * @brief  Return the FLASH Non-volatile state Option Bytes value.
  *
  * @retval Value of Non-volatile state
  */
static uint32_t FLASH_OB_GetNV(void)
{
  return (FLASH->NVSR & FLASH_NVSR_NVSTATE);
}

/**
  * @brief  Return the FLASH RoT Option Bytes value.
  *
  * @retval Value of the RoT
  */
static uint32_t FLASH_OB_GetRoT(void)
{
  return (FLASH->ROTSR & (FLASH_ROTSR_OEM_PROVD | FLASH_ROTSR_DBG_AUTH | FLASH_ROTSR_IROT_SELECT));
}

/**
  * @brief  Return the FLASH Epoch Option Bytes value.
  *
  * @retval Value of the Epoch
  */
static uint32_t FLASH_OB_GetEpoch(void)
{
  return (FLASH->EPOCHSR & FLASH_EPOCHSR_EPOCH);
}

/**
  * @brief  Add a CRC sector to the list of sectors on which the CRC will be calculated
  * @param  Sector Specifies the CRC sector number
  * @retval None
  */
static void FLASH_CRC_AddSector(uint32_t Sector)
{
  /* Check the parameters */
  assert_param(IS_FLASH_SECTOR(Sector));

  /* Clear CRC sector */
  MODIFY_REG(FLASH->CRCCR, FLASH_CRCCR_CRC_SECT, Sector);

  /* Activate ADD_SECT bit */
  SET_BIT(FLASH->CRCCR, FLASH_CRCCR_ADD_SECT);
}

/**
  * @brief  Select CRC start and end memory addresses on which the CRC will be calculated
  * @param  CRCStartAddr Specifies the CRC start address
  * @param  CRCEndAddr Specifies the CRC end address
  * @retval None
  */
static void FLASH_CRC_SelectAddress(uint32_t CRCStartAddr, uint32_t CRCEndAddr)
{
  assert_param(IS_FLASH_MAIN_MEM_ADDRESS(CRCStartAddr));
  assert_param(IS_FLASH_MAIN_MEM_ADDRESS(CRCEndAddr));

  /* Write CRC Start and End addresses */
  FLASH->CRCSADDR = (CRCStartAddr - FLASH_BASE);
  FLASH->CRCEADDR = (CRCEndAddr - FLASH_BASE);
}

/**
  * @brief  Wait for a FLASH CRC computation to complete.
  * @param  Timeout maximum flash operation timeout
  * @retval HAL_StatusTypeDef HAL Status
  */
static HAL_StatusTypeDef FLASH_CRC_WaitForLastOperation(uint32_t Timeout)
{
  uint32_t timeout = HAL_GetTick() + Timeout;

  /* Wait for the FLASH CRC computation to complete by polling on CRC_BUSY flag to be reset */
  while ((FLASH->SR & FLASH_SR_CRC_BUSY) != 0U)
  {
    if (HAL_GetTick() >= timeout)
    {
      return HAL_TIMEOUT;
    }
  }

  /* Check FLASH CRC calculation error flag  */
  if ((FLASH->ISR & FLASH_FLAG_CRCERR) != 0U)
  {
    /*Save the error code*/
    pFlash.ErrorCode |= HAL_FLASH_ERROR_CRC;

    /* Clear CRC error flag */
    FLASH->ICR = FLASH_FLAG_CRCERR;

    return HAL_ERROR;
  }

  /* Check FLASH CRC End of Calculation flag  */
  if ((FLASH->ISR & FLASH_FLAG_CRCEND) != 0U)
  {
    /* Clear FLASH End of Calculation pending bit */
    FLASH->ICR = FLASH_FLAG_CRCEND;
  }

  /* If there is no error flag set */
  return HAL_OK;
}

/**
  * @}
  */

/**
  * @}
  */

#endif /* HAL_FLASH_MODULE_ENABLED */

/**
  * @}
  */

/**
  * @}
  */
